"I was born in 1989 to two wonderful parents who, from the beginning, instilled in me a curiosity matched only by <a href=\"https:\/\/www.curiousgeorge.com\" target=\"_blank\" rel=\"noopener noreferrer\">George</a>. I owe much of my precociousness to my older brother, whose example I was constantly emulating despite our 2-year age difference. At 8 months, seeing him running around, I thought it was high-time I did too; when he was transitioning away from bicycle training wheels, I decided to skip them entirely.\nThis drive to challenge myself and learn quickly has stayed with me. In middle school, I wasn't satisfied with learning the trumpet; I spent a couple months learning the flute, saxophone, and clarinet, so that I could play all four instruments in the spring concert. I even began giving trumpet lessons as a middle-school student. But my passion for learning went as wide as it went deep. As a high school student, I was co-valedictorian, 2-time top-ten national qualifier in DECA marketing and economics competitions, 4-time state finalist in Forensics, conference finalist on the Math team, all-conference Cross-Country runner, and I won numerous academic awards, all while participating in school and county plays and musicals, arranging full ensemble pieces for concert and jazz band, working for the after-school program, and building furniture when time allowed. To say the least, I rarely struggled to fill my time with activities!\nEven given all of this discovery, attending Carleton College opened my eyes to a wealth of new learning opportunities. I leapt into activities left and right: Experimental Theater Board, improvisation and sketch comedy, competitive ballroom dancing, a cappella and choir, classical guitar, gymnastics, figure skating, and much more. I also made one discovery that has molded the life I'm currently living: French, which would inspire my first study abroad experience in Paris. While there, I was given the opportunity to join a team of volunteers who descended into the restricted Parisian catacombs to clean up the filth left there by trespassers throughout the year. I stayed in Europe for six months with the help of the Newman Fellowship Award, which allowed me to work at the ProLingus language institute in Belgium and spend two weeks biking around Germany and Austria. But I hadn't had enough, so I went on a second study abroad adventure to Spain. Before starting the program, I lived with a friend in Valencia, went on another two-week bike trip along the Danube river, and walked the Camino de Santiago from St.-Jean-Pied-de-Port to Finisterra (1061 km) meeting fascinating people and making wonderful friends along the way. After the program, I hopped over to the Czech Republic, Poland, and France before returning to the US for Christmas.\nI graduated 'magna cum laude' with a BA in Romance Languages and was awarded the Jean Schmidt prize for 'enthusiasm for learning and love of people.' Soon after, I moved to a suburb of Paris and enrolled in a regional conservatory, using my language skills to win my bread. In 2014 I moved to Brussels, Belgium and enrolled in the Royal Conservatory whose more immersive environment helped me finally decide whether music and I were compatible. Much to my professors' dismay, I have found that music doesn't fulfill my intellectual curiosity enough, nor am I sufficiently motivated to adopt the extreme discipline that is required to be a great performer.\nThus, it has been my side projects and professional experience that have most informed my new professional orientation; Software and web development allow me to express my curiosity, creativity, and problem solving skills while building tools that help people. In 2013 I started working for Fluentu.com, an internet startup in language learning. My work with FluentU has helped develop my JavaScript, HTML, CSS and Jquery skills enormously. I've also spent time since then on codecademy.com and codeschool.com (as well as YouTube, blogs, and books) learning C, Ruby, Ruby on Rails, AngularJS, JavaScript, Express.js and iOS programming (Objective-C and Swift). I'm very excited about learning and using technology to create powerful and meaningful tools for people and businesses."